const findTasksByFilter = `
Найти задачи по фильтру.
Находит задачи, соответствующие заданным критериям фильтрации, таким как _id, имя задачи, описание, статус, позиция, срок выполнения, категория, цвет, теги.
Примеры запросов:
- Найти задачи с именем Отчеты.
- Найти задачи с описанием Срочно.
- Найти задачи со статусом Выполнено.
- Найти задачи с цветом #FF5733.
- Найти задачи с тегами ["важное", "срочное"].
- Найти задачи в категории Рабочие.
- Найти задачи с позицией больше 5.
- Найти категории в пространстве Личное.
- Получить все задачи.
- Найти задачи и получить её категорию.
- Найти задачи и получить её цвет.
- Найти задачи и получить её доску.
- Найти задачи и получить её позицию.
- Найти задачи и получить её теги.
- Найти задачи и получить её пространство.
`

const findCategoriesByFilter = `
Найти категории по фильтру.
Находит категории, соответствующие заданным критериям фильтрации, таким как _id, имя категории, позиция.
Примеры запросов:
- Найти категории с именем Отчеты.
- Найти категории в доске Важное.
- Найти категории в пространстве Работа.
- Найти категории с позицией больше 5.
- Получить все категории.
- Найти категорию и получить её доску.
- Найти категорию и получить её позицию.
- Найти категорию и получить её пространство.
`

const findBoardsByFilter = `
Найти доски по фильтру.
Находит доски, соответствующие заданным критериям фильтрации, таким как _id, имя доски, позиция.
Примеры запросов:
- Найти доски с именем Отчеты.
- Найти доски в пространстве Работа.
- Найти доски с позицией 1.
- Получить все доски.
- Найти доску и получить её пространство.
- Найти доску и получить её позицию.
`

const findWorkspacesByFilter = `
Найти рабочие пространства по фильтру.
Находит рабочие пространства, соответствующие заданным критериям фильтрации, таким как _id, имя рабочего пространства, позиция.
Примеры запросов:
- Найти рабочие пространства с именем Отчеты.
- Найти рабочие пространства с позицией 1.
- Получить все рабочие пространства.
- Найти рабочее пространство и получить его позицию.
`

const findRelevantTasks = `
Находит семантически релевантные ЗАДАЧИ. Находит близкие по смыслу ЗАДАЧИ на основе их описаний. Возвращает массив релевантных ЗАДАЧ.
Примеры запросов:
- Найти задачи связанные с Отпуском.
- Найти задачи связанные с Работой.
- Найти задачи близкие по смыслу к Семье.
- Найти задачи близкие по смыслу к Хобби.
- Найти подходящие задачи для проекта Маркетинг.
`

const findRelevantCategories = `
Находит семантически релевантные КАТЕГОРИИ. Находит близкие по смыслу КАТЕГОРИИ на основе их описаний. Возвращает массив релевантных КАТЕГОРИЙ.
Примеры запросов:
- Найти категории связанные с Отпуском.
- Найти категории связанные с Работой.
- Найти категории близкие по смыслу к Семье.
- Найти категории близкие по смыслу к Хобби.
- Найти подходящие категории для проекта Маркетинг.
`

const findRelevantBoards = `
Находит семантически релевантные ДОСКИ. Находит близкие по смыслу ДОСКИ на основе их описаний. Возвращает массив релевантных ДОСОК.
Примеры запросов:
- Найти доски связанные с Отпуском.
- Найти доски связанные с Работой.
- Найти доски близкие по смыслу к Семье.
- Найти доски близкие по смыслу к Хобби.
- Найти подходящие доски для проекта Маркетинг.
`

const findRelevantWorkspaces = `
Находит семантически релевантные РАБОЧИЕ ПРОСТРАНСТВА. Находит близкие по смыслу РАБОЧИЕ ПРОСТРАНСТВА на основе их описаний. Возвращает массив релевантных РАБОЧИХ ПРОСТРАНСТВ.
Примеры запросов:
- Найти рабочие пространства связанные с Отпуском.
- Найти рабочие пространства связанные с Работой.
- Найти рабочие пространства близкие по смыслу к Семье.
- Найти рабочие пространства близкие по смыслу к Хобби.
- Найти подходящие рабочие пространства для проекта Маркетинг.
`

const createTasks = `
Создать ЗАДАЧИ с определенными атрибутами. Создать одну или несколько ЗАДАЧ с заданными параметрами, такими как имя, описание, статус, позиция, срок выполнения, категория, цвет, теги.
Примеры запросов:
- Создать задачу с именем Отчеты и описанием Ежемесячные отчеты.
- Создать задачу с именем Встреча и сроком выполнения завтра.
- Создать задачу с тегами ["важное", "срочное"].
- Создать задачу в категории Работа с цветом #FF5733.
- Создать несколько задач с разными именами и описаниями.
`

const createCategories = `
Создать КАТЕГОРИИ с определенными атрибутами. Создать одну или несколько КАТЕГОРИЙ с заданными параметрами, такими как имя, позиция.
Примеры запросов:
- Создать категорию с именем Отчеты и позицией 1.
- Создать категорию с именем Важное и позицией 2.
- Создать несколько категорий с разными именами и позициями.
`

const createBoards = `
Создать ДОСКИ с определенными атрибутами. Создать одну или несколько ДОСОК с заданными параметрами, такими как имя, позиция.
Примеры запросов:
- Создать доску с именем Отчеты и позицией 1.
- Создать доску с именем Важное и позицией 2.
- Создать несколько досок с разными именами и позициями.
`

const createWorkspaces = `
Создать РАБОЧИЕ ПРОСТРАНСТВА с определенными атрибутами. Создать одно или несколько РАБОЧИХ ПРОСТРАНСТВ с заданными параметрами, такими как имя, позиция.
Примеры запросов:
- Создать рабочее пространство с именем Отчеты и позицией 1.
- Создать рабочее пространство с именем Важное и позицией 2.
- Создать несколько рабочих пространств с разными именами и позициями.
`

const editTasks = `
Изменить ЗАДАЧИ. Изменить имя ЗАДАЧИ, описание, установить дату, срок выполнения. Переместить ЗАДАЧУ между категориями. Изменить, переместить ЗАДАЧИ по порядку. Установить или изменить цвет. Изменить, добавлять теги.
Примеры запросов:
- Изменить имя задачи на Отчеты.
- Изменить описание задачи на Ежемесячные отчеты.
- Установить дату задачи на 2023-12-31.
- Установить срок выполнения задачи на завтра.
- Переместить задачу в категорию Работа.
- Изменить цвет задачи на #FF5733.
- Добавить теги ["важное", "срочное"] к задаче.
- Удалить тег "важное" из задачи.
- Изменить позицию задачи на 1.
- Изменить несколько атрибутов задачи одновременно.
- Изменить несколько задач одновременно.
`

const editCategories = `
Изменить КАТЕГОРИИ. Изменить имя КАТЕГОРИИ, положение. Переместить КАТЕГОРИЮ между досками. Изменить, переместить КАТЕГОРИИ по порядку.
Примеры запросов:
- Изменить имя категории на Отчеты.
- Изменить положение категории на 1.
- Переместить категорию в доску Работа.
- Изменить несколько атрибутов категории одновременно.
- Изменить несколько категорий одновременно.
`

const editBoards = `
Изменить ДОСКИ. Изменить имя ДОСКИ, положение. Переместить ДОСКУ между рабочими пространствами. Изменить, переместить ДОСКИ по порядку.
Примеры запросов:
- Изменить имя доски на Отчеты.
- Изменить положение доски на 1.
- Переместить доску в рабочее пространство Работа.
- Изменить несколько атрибутов доски одновременно.
- Изменить несколько досок одновременно.
`

const editWorkspaces = `
Изменить РАБОЧИЕ ПРОСТРАНСТВА. Изменить имя РАБОЧЕГО ПРОСТРАНСТВА, положение. Изменить, переместить РАБОЧИЕ ПРОСТРАНСТВА по порядку.
Примеры запросов:
- Изменить имя рабочего пространства на Отчеты.
- Изменить положение рабочего пространства на 1.
- Изменить несколько атрибутов рабочего пространства одновременно.
- Изменить несколько рабочих пространств одновременно.
`

const archiveTasks = `
Архивировать ЗАДАЧИ. Переместить ЗАДАЧУ в архив. Переместить ЗАДАЧУ в корзину.
Примеры запросов:
- Архивировать задачу с именем Отчеты.
- Архивировать задачу с именем Важное.
- Архивировать несколько задач одновременно.
- Добавить задачу в корзину.
`

const archiveCategories = `
Архивировать КАТЕГОРИИ. Переместить КАТЕГОРИЮ в архив. Переместить КАТЕГОРИЮ в корзину.
Примеры запросов:
- Архивировать категорию с именем Отчеты.
- Архивировать категорию с именем Важное.
- Архивировать несколько категорий одновременно.
- Добавить категорию в корзину.
`

const archiveBoards = `
Архивировать ДОСКИ. Переместить ДОСКУ в архив. Переместить ДОСКУ в корзину.
Примеры запросов:
- Архивировать доску с именем Отчеты.
- Архивировать доску с именем Важное.
- Архивировать несколько досок одновременно.
- Добавить доску в корзину.
`

const archiveWorkspaces = `
Архивировать РАБОЧИЕ ПРОСТРАНСТВА. Переместить РАБОЧЕЕ ПРОСТРАНСТВО в архив. Переместить РАБОЧЕЕ ПРОСТРАНСТВО в корзину.
Примеры запросов:
- Архивировать рабочее пространство с именем Отчеты.
- Архивировать рабочее пространство с именем Важное.
- Архивировать несколько рабочих пространств одновременно.
- Добавить рабочее пространство в корзину.
`

const recoverTasks = `
Восстановить ЗАДАЧИ из архива или корзины. Вернуть ЗАДАЧУ из архива или корзины в активное состояние.
Примеры запросов:
- Восстановить задачу с именем Отчеты.
- Восстановить задачу с именем Важное.
- Восстановить несколько задач одновременно.
- Вернуть задачу из корзины.
- Активировать задачу из архива.
`

const recoverCategories = `
Восстановить КАТЕГОРИИ из архива или корзины. Вернуть КАТЕГОРИЮ из архива или корзины в активное состояние.
Примеры запросов:
- Восстановить категорию с именем Отчеты.
- Восстановить категорию с именем Важное.
- Восстановить несколько категорий одновременно.
- Вернуть категорию из корзины.
- Активировать категорию из архива.
`

const recoverBoards = `
Восстановить ДОСКИ из архива или корзины. Вернуть ДОСКУ из архива или корзины в активное состояние.
Примеры запросов:
- Восстановить доску с именем Отчеты.
- Восстановить доску с именем Важное.
- Восстановить несколько досок одновременно.
- Вернуть доску из корзины.
- Активировать доску из архива.
`

const recoverWorkspaces = `
Восстановить РАБОЧИЕ ПРОСТРАНСТВА из архива или корзины. Вернуть РАБОЧЕЕ ПРОСТРАНСТВО из архива или корзины в активное состояние.
Примеры запросов:
- Восстановить рабочее пространство с именем Отчеты.
- Восстановить рабочее пространство с именем Важное.
- Восстановить несколько рабочих пространств одновременно.
- Вернуть рабочее пространство из корзины.
- Активировать рабочее пространство из архива.
`

const deleteTasks = `
Удалить ЗАДАЧИ по определенным фильтрам. Полностью удалить ЗАДАЧУ из системы. Удалить ЗАДАЧИ по ID.
Примеры запросов:
- Удалить задачу с именем Отчеты.
- Удалить задачу с именем Важное.
- Удалить несколько задач одновременно.
- Удалить задачу по ID.
`

const deleteCategories = `
Удалить КАТЕГОРИИ по определенным фильтрам. Полностью удалить КАТЕГОРИЮ из системы. Удалить КАТЕГОРИИ по ID.
Примеры запросов:
- Удалить категорию с именем Отчеты.
- Удалить категорию с именем Важное.
- Удалить несколько категорий одновременно.
- Удалить категорию по ID.
`

const deleteBoards = `
Удалить ДОСКИ по определенным фильтрам. Полностью удалить ДОСКУ из системы. Удалить ДОСКИ по ID.
Примеры запросов:
- Удалить доску с именем Отчеты.
- Удалить доску с именем Важное.
- Удалить несколько досок одновременно.
- Удалить доску по ID.
`

const deleteWorkspaces = `
Удалить РАБОЧИЕ ПРОСТРАНСТВА по определенным фильтрам. Полностью удалить РАБОЧЕЕ ПРОСТРАНСТВО из системы. Удалить РАБОЧИЕ ПРОСТРАНСТВА по ID.
Примеры запросов:
- Удалить рабочее пространство с именем Отчеты.
- Удалить рабочее пространство с именем Важное.
- Удалить несколько рабочих пространств одновременно.
- Удалить рабочее пространство по ID.
`

export const toolsDescriptions = {
  findTasksByFilter,
  findCategoriesByFilter,
  findBoardsByFilter,
  findWorkspacesByFilter,

  findRelevantTasks,
  findRelevantCategories,
  findRelevantBoards,
  findRelevantWorkspaces,

  createTasks,
  createCategories,
  createBoards,
  createWorkspaces,

  editTasks,
  editCategories,
  editBoards,
  editWorkspaces,

  archiveWorkspaces,
  archiveBoards,
  archiveCategories,
  archiveTasks,

  recoverWorkspaces,
  recoverBoards,
  recoverCategories,
  recoverTasks,

  deleteWorkspaces,
  deleteBoards,
  deleteCategories,
  deleteTasks,
}
